Revit 2027 API
SymbolGeometryId.AsUniqueIdentifier Method
 Returns a string suitable to determine if two instances point to the same piece of geometry managed by the same symbol element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string AsUniqueIdentifier()
Public Function AsUniqueIdentifier As String
public:
String^ AsUniqueIdentifier()
member AsUniqueIdentifier : unit -> string
Return Value
String
 A string suitable to determine if two instances point to the same piece of geometry managed by the same symbol element.
See Also
Reference
SymbolGeometryId Class
Autodesk.Revit.DB Namespace